import { BodyTypography, Subtitle } from '../../../../../ui/typography';

import style from '../terms.module.css';

export const ContractBlock = () => (
  <div>
    <div className={style.termsBlockContainer}>
      <div className={style.termsBlockContentContainer}>
        <Subtitle size='large'>
          1. Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет собой
          интересный эксперимент проверки экспериментов, поражающих посвоей масштабности и грандиозности.
        </Subtitle>
        <div className={style.termsBlockInnerContentContainer}>
          <BodyTypography size='large'>
            1.1. Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
            участника как способного принимать собственные решения касаемо инновационных методов управления процессами.
          </BodyTypography>
          <BodyTypography size='large'>
            1.2. Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет
            важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики
            лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.{' '}
          </BodyTypography>
          <BodyTypography size='large'>
            1.3. Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
            экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
          </BodyTypography>
          <BodyTypography size='large'>
            1.4. Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
            политической культуры, будут объединены в целые кластеры себе подобных.
          </BodyTypography>
        </div>
      </div>
      <div className={style.termsBlockContentContainer}>
        <Subtitle size='large'>
          2. С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
          возможности для приоритизации разума над эмоциями.
        </Subtitle>
        <div className={style.termsBlockInnerContentContainer}>
          <BodyTypography size='large'>
            2.1. Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
            участника как способного принимать собственные решения касаемо инновационных методов управления процессами.
          </BodyTypography>
          <div className={style.termsBlockInnerContentContainer}>
            <BodyTypography size='large'>
              2.1.1 Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет
              важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики
              лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.{' '}
            </BodyTypography>
            <BodyTypography size='large'>
              2.1.2 Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
              экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
            </BodyTypography>
          </div>
          <BodyTypography size='large'>
            2.2. Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
            политической культуры, будут объединены в целые кластеры себе подобных.
          </BodyTypography>
        </div>
      </div>
      <div className={style.termsBlockContentContainer}>
        <Subtitle size='large'>
          3. С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
          возможности для приоритизации разума над эмоциями.
        </Subtitle>
        <div className={style.termsBlockInnerContentContainer}>
          <BodyTypography size='large'>
            3.1. Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
            участника как способного принимать собственные решения касаемо инновационных методов управления процессами.
          </BodyTypography>
          <div className={style.termsBlockInnerContentContainer}>
            <BodyTypography size='large'>
              3.1.1 Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет
              важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики
              лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.{' '}
            </BodyTypography>
            <BodyTypography size='large'>
              3.1.2 Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
              экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
            </BodyTypography>
          </div>
          <BodyTypography size='large'>
            3.2. Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
            политической культуры, будут объединены в целые кластеры себе подобных.
          </BodyTypography>
          <BodyTypography size='large'>
            3.3. Не следует, однако, забывать, что экономическая повестка сегодняшнего дня требует анализа анализа
            существующих паттернов поведения..
          </BodyTypography>
          <div className={style.termsBlockInnerContentContainer}>
            <BodyTypography size='large'>
              3.3.1. А ещё представители современных социальных резервов набирают популярность среди определенных слоев
              населения, а значит, должны быть функционально разнесены на независимые элементы.
            </BodyTypography>
            <div className={style.termsBlockInnerContentContainer}>
              <BodyTypography size='large'>
                3.3.1.1. Стремящиеся вытеснить традиционное производство, нанотехнологии могут быть объявлены
                нарушающими общечеловеческие нормы этики и морали.
              </BodyTypography>
              <BodyTypography size='large'>
                3.3.1.2. Прежде всего, разбавленное изрядной долей эмпатии, рациональное мышление однозначно фиксирует
                необходимость новых предложений. Являясь всего лишь частью общей картины, независимые государства
                представлены в исключительно положительном свете.
              </BodyTypography>
            </div>
            <BodyTypography size='large'>
              3.4. Повседневная практика показывает, что убеждённость некоторых оппонентов требует от нас анализа
              распределения внутренних резервов и ресурсов.
            </BodyTypography>
          </div>
        </div>
      </div>
    </div>
  </div>
);
